IOsetting/FwLib_STC8/include/fw_reg_stc8h.h
#ifndef __FW_REG_STC8H_H__
#define __FW_REG_STC8H_H__

#include "fw_reg_base.h"

SFR(VRTRIM,             0xA6);

SFR(USBCLK,             0xDC);

SFR(ADCCFG,             0xDE);
SFR(IP3,                0xDF);

SFR(P7M1,               0xE1);
SFR(P7M0,               0xE2);
SFR(DPS,                0xE3);
SFR(DPL1,               0xE4);
SFR(DPH1,               0xE5);
SFR(CMPCR1,             0xE6);
SFR(CMPCR2,             0xE7);

SFR(USBDAT,             0xEC);
SFR(IP3H,               0xEE);
SFR(AUXINTIF,           0xEF);

SFR(USBCON,             0xF4);

SFR(IAP_TPS,            0xF5);

SFR(USBADR,             0xFC);

SFR(RSTCFG,             0xFF);


/**
 * Set B7 of P_SW2 before read/write the following registers
*/

/////////////////////////////////////////////////
//FF00H-FFFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//FE00H-FEFFH
/////////////////////////////////////////////////

#define CKSEL             (*(unsigned char volatile __XDATA *)0xfe00)
#define CLKDIV            (*(unsigned char volatile __XDATA *)0xfe01)
#define HIRCCR            (*(unsigned char volatile __XDATA *)0xfe02)
#define XOSCCR            (*(unsigned char volatile __XDATA *)0xfe03)
#define IRC32KCR          (*(unsigned char volatile __XDATA *)0xfe04)
#define MCLKOCR           (*(unsigned char volatile __XDATA *)0xfe05)
#define IRCDB             (*(unsigned char volatile __XDATA *)0xfe06)
#define X32KCR            (*(unsigned char volatile __XDATA *)0xfe08)
#define PxPU                                                  0xfe10
#define P0PU                                           SFRX(PxPU + 0)
#define P1PU                                           SFRX(PxPU + 1)
#define P2PU              (*(unsigned char volatile __XDATA *)0xfe12)
#define P3PU              (*(unsigned char volatile __XDATA *)0xfe13)
#define P4PU              (*(unsigned char volatile __XDATA *)0xfe14)
#define P5PU              (*(unsigned char volatile __XDATA *)0xfe15)
#define P6PU              (*(unsigned char volatile __XDATA *)0xfe16)
#define P7PU              (*(unsigned char volatile __XDATA *)0xfe17)
#define PxNCS                                                 0xfe18
#define P0NCS             (*(unsigned char volatile __XDATA *)0xfe18)
#define P1NCS             (*(unsigned char volatile __XDATA *)0xfe19)
#define P2NCS             (*(unsigned char volatile __XDATA *)0xfe1a)
#define P3NCS             (*(unsigned char volatile __XDATA *)0xfe1b)
#define P4NCS             (*(unsigned char volatile __XDATA *)0xfe1c)
#define P5NCS             (*(unsigned char volatile __XDATA *)0xfe1d)
#define P6NCS             (*(unsigned char volatile __XDATA *)0xfe1e)
#define P7NCS             (*(unsigned char volatile __XDATA *)0xfe1f)
#define PxSR                                                  0xfe20
#define P0SR              (*(unsigned char volatile __XDATA *)0xfe20)
#define P1SR              (*(unsigned char volatile __XDATA *)0xfe21)
#define P2SR              (*(unsigned char volatile __XDATA *)0xfe22)
#define P3SR              (*(unsigned char volatile __XDATA *)0xfe23)
#define P4SR              (*(unsigned char volatile __XDATA *)0xfe24)
#define P5SR              (*(unsigned char volatile __XDATA *)0xfe25)
#define P6SR              (*(unsigned char volatile __XDATA *)0xfe26)
#define P7SR              (*(unsigned char volatile __XDATA *)0xfe27)
#define PxDR                                                  0xfe28
#define P0DR              (*(unsigned char volatile __XDATA *)0xfe28)
#define P1DR              (*(unsigned char volatile __XDATA *)0xfe29)
#define P2DR              (*(unsigned char volatile __XDATA *)0xfe2a)
#define P3DR              (*(unsigned char volatile __XDATA *)0xfe2b)
#define P4DR              (*(unsigned char volatile __XDATA *)0xfe2c)
#define P5DR              (*(unsigned char volatile __XDATA *)0xfe2d)
#define P6DR              (*(unsigned char volatile __XDATA *)0xfe2e)
#define P7DR              (*(unsigned char volatile __XDATA *)0xfe2f)
#define PxIE                                                  0xfe30
#define P0IE              (*(unsigned char volatile __XDATA *)0xfe30)
#define P1IE              (*(unsigned char volatile __XDATA *)0xfe31)
#define P2IE              (*(unsigned char volatile __XDATA *)0xfe32)
#define P3IE              (*(unsigned char volatile __XDATA *)0xfe33)
#define P4IE              (*(unsigned char volatile __XDATA *)0xfe34)
#define P5IE              (*(unsigned char volatile __XDATA *)0xfe35)
#define P6IE              (*(unsigned char volatile __XDATA *)0xfe36)
#define P7IE              (*(unsigned char volatile __XDATA *)0xfe37)
#define LCMIFCFG          (*(unsigned char volatile __XDATA *)0xfe50)
#define RTCCR             (*(unsigned char volatile __XDATA *)0xfe60)
#define RTCCFG            (*(unsigned char volatile __XDATA *)0xfe61)
#define RTCIEN            (*(unsigned char volatile __XDATA *)0xfe62)
#define RTCIF             (*(unsigned char volatile __XDATA *)0xfe63)
#define ALAHOUR           (*(unsigned char volatile __XDATA *)0xfe64)
#define ALAMIN            (*(unsigned char volatile __XDATA *)0xfe65)
#define ALASEC            (*(unsigned char volatile __XDATA *)0xfe66)
#define ALASSEC           (*(unsigned char volatile __XDATA *)0xfe67)
#define INIYEAR           (*(unsigned char volatile __XDATA *)0xfe68)
#define INIMONTH          (*(unsigned char volatile __XDATA *)0xfe69)
#define INIDAY            (*(unsigned char volatile __XDATA *)0xfe6a)
#define INIHOUR           (*(unsigned char volatile __XDATA *)0xfe6b)
#define INIMIN            (*(unsigned char volatile __XDATA *)0xfe6c)
#define INISEC            (*(unsigned char volatile __XDATA *)0xfe6d)
#define INISSEC           (*(unsigned char volatile __XDATA *)0xfe6e)
#define YEAR              (*(unsigned char volatile __XDATA *)0xfe70)
#define MONTH             (*(unsigned char volatile __XDATA *)0xfe71)
#define DAY               (*(unsigned char volatile __XDATA *)0xfe72)
#define HOUR              (*(unsigned char volatile __XDATA *)0xfe73)
#define MIN               (*(unsigned char volatile __XDATA *)0xfe74)
#define SEC               (*(unsigned char volatile __XDATA *)0xfe75)
#define SSEC              (*(unsigned char volatile __XDATA *)0xfe76)

