IOsetting/FwLib_STC8/include/fw_reg_stc8h.h
#define I2CCFG            (*(unsigned char volatile __XDATA *)0xfe80)
#define I2CMSCR           (*(unsigned char volatile __XDATA *)0xfe81)
#define I2CMSST           (*(unsigned char volatile __XDATA *)0xfe82)
#define I2CSLCR           (*(unsigned char volatile __XDATA *)0xfe83)
#define I2CSLST           (*(unsigned char volatile __XDATA *)0xfe84)
#define I2CSLADR          (*(unsigned char volatile __XDATA *)0xfe85)
#define I2CTXD            (*(unsigned char volatile __XDATA *)0xfe86)
#define I2CRXD            (*(unsigned char volatile __XDATA *)0xfe87)
#define I2CMSAUX          (*(unsigned char volatile __XDATA *)0xfe88)

#define TM2PS             (*(unsigned char volatile __XDATA *)0xfea2)
#define TM3PS             (*(unsigned char volatile __XDATA *)0xfea3)
#define TM4PS             (*(unsigned char volatile __XDATA *)0xfea4)
#define ADCTIM            (*(unsigned char volatile __XDATA *)0xfea8)

/**
 * suppress xdata space memory overlap
 */
/*
#define PWM1_ETRPS        (*(unsigned char volatile __XDATA *)0xfeb0)
#define PWM1_ENO          (*(unsigned char volatile __XDATA *)0xfeb1)
#define PWM1_PS           (*(unsigned char volatile __XDATA *)0xfeb2)
#define PWM1_IOAUX        (*(unsigned char volatile __XDATA *)0xfeb3)
#define PWM2_ETRPS        (*(unsigned char volatile __XDATA *)0xfeb4)
#define PWM2_ENO          (*(unsigned char volatile __XDATA *)0xfeb5)
#define PWM2_PS           (*(unsigned char volatile __XDATA *)0xfeb6)
#define PWM2_IOAUX        (*(unsigned char volatile __XDATA *)0xfeb7)
#define PWM1_CR1          (*(unsigned char volatile __XDATA *)0xfec0)
#define PWM1_CR2          (*(unsigned char volatile __XDATA *)0xfec1)
#define PWM1_SMCR         (*(unsigned char volatile __XDATA *)0xfec2)
#define PWM1_ETR          (*(unsigned char volatile __XDATA *)0xfec3)
#define PWM1_IER          (*(unsigned char volatile __XDATA *)0xfec4)
#define PWM1_SR1          (*(unsigned char volatile __XDATA *)0xfec5)
#define PWM1_SR2          (*(unsigned char volatile __XDATA *)0xfec6)
#define PWM1_EGR          (*(unsigned char volatile __XDATA *)0xfec7)
#define PWM1_CCMR1        (*(unsigned char volatile __XDATA *)0xfec8)
#define PWM1_CCMR2        (*(unsigned char volatile __XDATA *)0xfec9)
#define PWM1_CCMR3        (*(unsigned char volatile __XDATA *)0xfeca)
#define PWM1_CCMR4        (*(unsigned char volatile __XDATA *)0xfecb)
#define PWM1_CCER1        (*(unsigned char volatile __XDATA *)0xfecc)
#define PWM1_CCER2        (*(unsigned char volatile __XDATA *)0xfecd)
#define PWM1_CNTR         (*(unsigned int  volatile __XDATA *)0xfece)
#define PWM1_CNTRH        (*(unsigned char volatile __XDATA *)0xfece)
#define PWM1_CNTRL        (*(unsigned char volatile __XDATA *)0xfecf)
#define PWM1_PSCR         (*(unsigned int  volatile __XDATA *)0xfed0)
#define PWM1_PSCRH        (*(unsigned char volatile __XDATA *)0xfed0)
#define PWM1_PSCRL        (*(unsigned char volatile __XDATA *)0xfed1)
#define PWM1_ARR          (*(unsigned int  volatile __XDATA *)0xfed2)
#define PWM1_ARRH         (*(unsigned char volatile __XDATA *)0xfed2)
#define PWM1_ARRL         (*(unsigned char volatile __XDATA *)0xfed3)
#define PWM1_RCR          (*(unsigned char volatile __XDATA *)0xfed4)
#define PWM1_CCR1         (*(unsigned int  volatile __XDATA *)0xfed5)
#define PWM1_CCR1H        (*(unsigned char volatile __XDATA *)0xfed5)
#define PWM1_CCR1L        (*(unsigned char volatile __XDATA *)0xfed6)
#define PWM1_CCR2         (*(unsigned int  volatile __XDATA *)0xfed7)
#define PWM1_CCR2H        (*(unsigned char volatile __XDATA *)0xfed7)
#define PWM1_CCR2L        (*(unsigned char volatile __XDATA *)0xfed8)
#define PWM1_CCR3         (*(unsigned int  volatile __XDATA *)0xfed9)
#define PWM1_CCR3H        (*(unsigned char volatile __XDATA *)0xfed9)
#define PWM1_CCR3L        (*(unsigned char volatile __XDATA *)0xfeda)
#define PWM1_CCR4         (*(unsigned int  volatile __XDATA *)0xfedb)
#define PWM1_CCR4H        (*(unsigned char volatile __XDATA *)0xfedb)
#define PWM1_CCR4L        (*(unsigned char volatile __XDATA *)0xfedc)
#define PWM1_BKR          (*(unsigned char volatile __XDATA *)0xfedd)
#define PWM1_DTR          (*(unsigned char volatile __XDATA *)0xfede)
#define PWM1_OISR         (*(unsigned char volatile __XDATA *)0xfedf)
#define PWM2_CR1          (*(unsigned char volatile __XDATA *)0xfee0)
#define PWM2_CR2          (*(unsigned char volatile __XDATA *)0xfee1)
#define PWM2_SMCR         (*(unsigned char volatile __XDATA *)0xfee2)
#define PWM2_ETR          (*(unsigned char volatile __XDATA *)0xfee3)
#define PWM2_IER          (*(unsigned char volatile __XDATA *)0xfee4)
#define PWM2_SR1          (*(unsigned char volatile __XDATA *)0xfee5)
#define PWM2_SR2          (*(unsigned char volatile __XDATA *)0xfee6)
#define PWM2_EGR          (*(unsigned char volatile __XDATA *)0xfee7)
#define PWM2_CCMR1        (*(unsigned char volatile __XDATA *)0xfee8)
#define PWM2_CCMR2        (*(unsigned char volatile __XDATA *)0xfee9)
#define PWM2_CCMR3        (*(unsigned char volatile __XDATA *)0xfeea)
#define PWM2_CCMR4        (*(unsigned char volatile __XDATA *)0xfeeb)
#define PWM2_CCER1        (*(unsigned char volatile __XDATA *)0xfeec)
#define PWM2_CCER2        (*(unsigned char volatile __XDATA *)0xfeed)
#define PWM2_CNTR         (*(unsigned int  volatile __XDATA *)0xfeee)
#define PWM2_CNTRH        (*(unsigned char volatile __XDATA *)0xfeee)
#define PWM2_CNTRL        (*(unsigned char volatile __XDATA *)0xfeef)
#define PWM2_PSCR         (*(unsigned int  volatile __XDATA *)0xfef0)
#define PWM2_PSCRH        (*(unsigned char volatile __XDATA *)0xfef0)
#define PWM2_PSCRL        (*(unsigned char volatile __XDATA *)0xfef1)
#define PWM2_ARR          (*(unsigned int  volatile __XDATA *)0xfef2)
#define PWM2_ARRH         (*(unsigned char volatile __XDATA *)0xfef2)
#define PWM2_ARRL         (*(unsigned char volatile __XDATA *)0xfef3)
#define PWM2_RCR          (*(unsigned char volatile __XDATA *)0xfef4)
#define PWM2_CCR1         (*(unsigned int  volatile __XDATA *)0xfef5)
#define PWM2_CCR1H        (*(unsigned char volatile __XDATA *)0xfef5)
#define PWM2_CCR1L        (*(unsigned char volatile __XDATA *)0xfef6)
#define PWM2_CCR2         (*(unsigned int  volatile __XDATA *)0xfef7)
#define PWM2_CCR2H        (*(unsigned char volatile __XDATA *)0xfef7)
#define PWM2_CCR2L        (*(unsigned char volatile __XDATA *)0xfef8)
#define PWM2_CCR3         (*(unsigned int  volatile __XDATA *)0xfef9)
#define PWM2_CCR3H        (*(unsigned char volatile __XDATA *)0xfef9)
#define PWM2_CCR3L        (*(unsigned char volatile __XDATA *)0xfefa)
#define PWM2_CCR4         (*(unsigned int  volatile __XDATA *)0xfefb)
#define PWM2_CCR4H        (*(unsigned char volatile __XDATA *)0xfefb)
#define PWM2_CCR4L        (*(unsigned char volatile __XDATA *)0xfefc)
#define PWM2_BKR          (*(unsigned char volatile __XDATA *)0xfefd)
#define PWM2_DTR          (*(unsigned char volatile __XDATA *)0xfefe)
#define PWM2_OISR         (*(unsigned char volatile __XDATA *)0xfeff)
*/

#define PWMA_ETRPS        (*(unsigned char volatile __XDATA *)0xfeb0)
#define PWMA_ENO          (*(unsigned char volatile __XDATA *)0xfeb1)
#define PWMA_PS           (*(unsigned char volatile __XDATA *)0xfeb2)
#define PWMA_IOAUX        (*(unsigned char volatile __XDATA *)0xfeb3)
#define PWMB_ETRPS        (*(unsigned char volatile __XDATA *)0xfeb4)
#define PWMB_ENO          (*(unsigned char volatile __XDATA *)0xfeb5)
#define PWMB_PS           (*(unsigned char volatile __XDATA *)0xfeb6)
#define PWMB_IOAUX        (*(unsigned char volatile __XDATA *)0xfeb7)
#define PWMA_CR1          (*(unsigned char volatile __XDATA *)0xfec0)
#define PWMA_CR2          (*(unsigned char volatile __XDATA *)0xfec1)
#define PWMA_SMCR         (*(unsigned char volatile __XDATA *)0xfec2)
#define PWMA_ETR          (*(unsigned char volatile __XDATA *)0xfec3)
#define PWMA_IER          (*(unsigned char volatile __XDATA *)0xfec4)
#define PWMA_SR1          (*(unsigned char volatile __XDATA *)0xfec5)
#define PWMA_SR2          (*(unsigned char volatile __XDATA *)0xfec6)
#define PWMA_EGR          (*(unsigned char volatile __XDATA *)0xfec7)
#define PWMA_CCMRx                                            0xfec8
#define PWMA_CCMR1        (*(unsigned char volatile __XDATA *)0xfec8)
#define PWMA_CCMR2        (*(unsigned char volatile __XDATA *)0xfec9)
#define PWMA_CCMR3        (*(unsigned char volatile __XDATA *)0xfeca)
#define PWMA_CCMR4        (*(unsigned char volatile __XDATA *)0xfecb)
#define PWMA_CCER1        (*(unsigned char volatile __XDATA *)0xfecc)
#define PWMA_CCER2        (*(unsigned char volatile __XDATA *)0xfecd)
#define PWMA_CNTR         (*(unsigned int  volatile __XDATA *)0xfece)
#define PWMA_CNTRH        (*(unsigned char volatile __XDATA *)0xfece)
#define PWMA_CNTRL        (*(unsigned char volatile __XDATA *)0xfecf)
#define PWMA_PSCR         (*(unsigned int  volatile __XDATA *)0xfed0)
#define PWMA_PSCRH        (*(unsigned char volatile __XDATA *)0xfed0)
#define PWMA_PSCRL        (*(unsigned char volatile __XDATA *)0xfed1)
#define PWMA_ARR          (*(unsigned int  volatile __XDATA *)0xfed2)
#define PWMA_ARRH         (*(unsigned char volatile __XDATA *)0xfed2)
#define PWMA_ARRL         (*(unsigned char volatile __XDATA *)0xfed3)
#define PWMA_RCR          (*(unsigned char volatile __XDATA *)0xfed4)
#define PWMA_CCR1         (*(unsigned int  volatile __XDATA *)0xfed5)
#define PWMA_CCR1H        (*(unsigned char volatile __XDATA *)0xfed5)
#define PWMA_CCR1L        (*(unsigned char volatile __XDATA *)0xfed6)
#define PWMA_CCR2         (*(unsigned int  volatile __XDATA *)0xfed7)
#define PWMA_CCR2H        (*(unsigned char volatile __XDATA *)0xfed7)
#define PWMA_CCR2L        (*(unsigned char volatile __XDATA *)0xfed8)
#define PWMA_CCR3         (*(unsigned int  volatile __XDATA *)0xfed9)
#define PWMA_CCR3H        (*(unsigned char volatile __XDATA *)0xfed9)
#define PWMA_CCR3L        (*(unsigned char volatile __XDATA *)0xfeda)
#define PWMA_CCR4         (*(unsigned int  volatile __XDATA *)0xfedb)
#define PWMA_CCR4H        (*(unsigned char volatile __XDATA *)0xfedb)
#define PWMA_CCR4L        (*(unsigned char volatile __XDATA *)0xfedc)
#define PWMA_BKR          (*(unsigned char volatile __XDATA *)0xfedd)
#define PWMA_DTR          (*(unsigned char volatile __XDATA *)0xfede)
#define PWMA_OISR         (*(unsigned char volatile __XDATA *)0xfedf)
#define PWMB_CR1          (*(unsigned char volatile __XDATA *)0xfee0)
#define PWMB_CR2          (*(unsigned char volatile __XDATA *)0xfee1)
#define PWMB_SMCR         (*(unsigned char volatile __XDATA *)0xfee2)
#define PWMB_ETR          (*(unsigned char volatile __XDATA *)0xfee3)
#define PWMB_IER          (*(unsigned char volatile __XDATA *)0xfee4)
#define PWMB_SR1          (*(unsigned char volatile __XDATA *)0xfee5)
#define PWMB_SR2          (*(unsigned char volatile __XDATA *)0xfee6)
#define PWMB_EGR          (*(unsigned char volatile __XDATA *)0xfee7)
#define PWMB_CCMRx                                            0xfee8
#define PWMB_CCMR1        (*(unsigned char volatile __XDATA *)0xfee8)
#define PWMB_CCMR2        (*(unsigned char volatile __XDATA *)0xfee9)
#define PWMB_CCMR3        (*(unsigned char volatile __XDATA *)0xfeea)
#define PWMB_CCMR4        (*(unsigned char volatile __XDATA *)0xfeeb)
#define PWMB_CCER1        (*(unsigned char volatile __XDATA *)0xfeec)
#define PWMB_CCER2        (*(unsigned char volatile __XDATA *)0xfeed)
#define PWMB_CNTR         (*(unsigned int  volatile __XDATA *)0xfeee)
#define PWMB_CNTRH        (*(unsigned char volatile __XDATA *)0xfeee)
#define PWMB_CNTRL        (*(unsigned char volatile __XDATA *)0xfeef)
#define PWMB_PSCR         (*(unsigned int  volatile __XDATA *)0xfef0)
#define PWMB_PSCRH        (*(unsigned char volatile __XDATA *)0xfef0)
#define PWMB_PSCRL        (*(unsigned char volatile __XDATA *)0xfef1)
#define PWMB_ARR          (*(unsigned int  volatile __XDATA *)0xfef2)
#define PWMB_ARRH         (*(unsigned char volatile __XDATA *)0xfef2)
#define PWMB_ARRL         (*(unsigned char volatile __XDATA *)0xfef3)
#define PWMB_RCR          (*(unsigned char volatile __XDATA *)0xfef4)
#define PWMB_CCR5         (*(unsigned int  volatile __XDATA *)0xfef5)
#define PWMB_CCR5H        (*(unsigned char volatile __XDATA *)0xfef5)
#define PWMB_CCR5L        (*(unsigned char volatile __XDATA *)0xfef6)
#define PWMB_CCR6         (*(unsigned int  volatile __XDATA *)0xfef7)
#define PWMB_CCR6H        (*(unsigned char volatile __XDATA *)0xfef7)
#define PWMB_CCR6L        (*(unsigned char volatile __XDATA *)0xfef8)
#define PWMB_CCR7         (*(unsigned int  volatile __XDATA *)0xfef9)
#define PWMB_CCR7H        (*(unsigned char volatile __XDATA *)0xfef9)
#define PWMB_CCR7L        (*(unsigned char volatile __XDATA *)0xfefa)
#define PWMB_CCR8         (*(unsigned int  volatile __XDATA *)0xfefb)
#define PWMB_CCR8H        (*(unsigned char volatile __XDATA *)0xfefb)
#define PWMB_CCR8L        (*(unsigned char volatile __XDATA *)0xfefc)
#define PWMB_BKR          (*(unsigned char volatile __XDATA *)0xfefd)
#define PWMB_DTR          (*(unsigned char volatile __XDATA *)0xfefe)
#define PWMB_OISR         (*(unsigned char volatile __XDATA *)0xfeff)


/////////////////////////////////////////////////
//FD00H-FDFFH
/////////////////////////////////////////////////

#define PxINTE                                                0xfd00
#define P0INTE            (*(unsigned char volatile __XDATA *)0xfd00)
#define P1INTE            (*(unsigned char volatile __XDATA *)0xfd01)
#define P2INTE            (*(unsigned char volatile __XDATA *)0xfd02)
#define P3INTE            (*(unsigned char volatile __XDATA *)0xfd03)
#define P4INTE            (*(unsigned char volatile __XDATA *)0xfd04)
#define P5INTE            (*(unsigned char volatile __XDATA *)0xfd05)
#define P6INTE            (*(unsigned char volatile __XDATA *)0xfd06)
#define P7INTE            (*(unsigned char volatile __XDATA *)0xfd07)
#define P0INTF            (*(unsigned char volatile __XDATA *)0xfd10)
#define P1INTF            (*(unsigned char volatile __XDATA *)0xfd11)
#define P2INTF            (*(unsigned char volatile __XDATA *)0xfd12)
#define P3INTF            (*(unsigned char volatile __XDATA *)0xfd13)
#define P4INTF            (*(unsigned char volatile __XDATA *)0xfd14)
#define P5INTF            (*(unsigned char volatile __XDATA *)0xfd15)
#define P6INTF            (*(unsigned char volatile __XDATA *)0xfd16)
#define P7INTF            (*(unsigned char volatile __XDATA *)0xfd17)
#define PxIM0                                                 0xfd20
#define P0IM0             (*(unsigned char volatile __XDATA *)0xfd20)
#define P1IM0             (*(unsigned char volatile __XDATA *)0xfd21)
#define P2IM0             (*(unsigned char volatile __XDATA *)0xfd22)
#define P3IM0             (*(unsigned char volatile __XDATA *)0xfd23)
#define P4IM0             (*(unsigned char volatile __XDATA *)0xfd24)
#define P5IM0             (*(unsigned char volatile __XDATA *)0xfd25)
#define P6IM0             (*(unsigned char volatile __XDATA *)0xfd26)
#define P7IM0             (*(unsigned char volatile __XDATA *)0xfd27)
#define PxIM1                                                 0xfd30
#define P0IM1             (*(unsigned char volatile __XDATA *)0xfd30)
#define P1IM1             (*(unsigned char volatile __XDATA *)0xfd31)
#define P2IM1             (*(unsigned char volatile __XDATA *)0xfd32)
#define P3IM1             (*(unsigned char volatile __XDATA *)0xfd33)
#define P4IM1             (*(unsigned char volatile __XDATA *)0xfd34)
#define P5IM1             (*(unsigned char volatile __XDATA *)0xfd35)
#define P6IM1             (*(unsigned char volatile __XDATA *)0xfd36)
#define P7IM1             (*(unsigned char volatile __XDATA *)0xfd37)
#define P0WKUE            (*(unsigned char volatile __XDATA *)0xfd40)
#define P1WKUE            (*(unsigned char volatile __XDATA *)0xfd41)
#define P2WKUE            (*(unsigned char volatile __XDATA *)0xfd42)
#define P3WKUE            (*(unsigned char volatile __XDATA *)0xfd43)
#define P4WKUE            (*(unsigned char volatile __XDATA *)0xfd44)
#define P5WKUE            (*(unsigned char volatile __XDATA *)0xfd45)
#define P6WKUE            (*(unsigned char volatile __XDATA *)0xfd46)
#define P7WKUE            (*(unsigned char volatile __XDATA *)0xfd47)
#define PIN_IP            (*(unsigned char volatile __XDATA *)0xfd60)
#define PIN_IPH           (*(unsigned char volatile __XDATA *)0xfd61)
#define CHIPIDxx                                              0xfde0
#define CHIPID00          (*(unsigned char volatile __XDATA *)0xfde0)

/////////////////////////////////////////////////
//FC00H-FCFFH
/////////////////////////////////////////////////

