IOsetting/FwLib_STC8/include/fw_reg_stc8h.h
#define DMA_ADC_CFG       (*(unsigned char volatile __XDATA *)0xfa10)
#define DMA_ADC_CR        (*(unsigned char volatile __XDATA *)0xfa11)
#define DMA_ADC_STA       (*(unsigned char volatile __XDATA *)0xfa12)
#define DMA_ADC_RXAH      (*(unsigned char volatile __XDATA *)0xfa17)
#define DMA_ADC_RXAL      (*(unsigned char volatile __XDATA *)0xfa18)
#define DMA_ADC_CFG2      (*(unsigned char volatile __XDATA *)0xfa19)
#define DMA_ADC_CHSW0     (*(unsigned char volatile __XDATA *)0xfa1a)
#define DMA_ADC_CHSW1     (*(unsigned char volatile __XDATA *)0xfa1b)

#define DMA_SPI_CFG       (*(unsigned char volatile __XDATA *)0xfa20)
#define DMA_SPI_CR        (*(unsigned char volatile __XDATA *)0xfa21)
#define DMA_SPI_STA       (*(unsigned char volatile __XDATA *)0xfa22)
#define DMA_SPI_AMT       (*(unsigned char volatile __XDATA *)0xfa23)
#define DMA_SPI_DONE      (*(unsigned char volatile __XDATA *)0xfa24)
#define DMA_SPI_TXAH      (*(unsigned char volatile __XDATA *)0xfa25)
#define DMA_SPI_TXAL      (*(unsigned char volatile __XDATA *)0xfa26)
#define DMA_SPI_RXAH      (*(unsigned char volatile __XDATA *)0xfa27)
#define DMA_SPI_RXAL      (*(unsigned char volatile __XDATA *)0xfa28)
#define DMA_SPI_CFG2      (*(unsigned char volatile __XDATA *)0xfa29)

#define DMA_UR1T_CFG      (*(unsigned char volatile __XDATA *)0xfa30)
#define DMA_UR1T_CR       (*(unsigned char volatile __XDATA *)0xfa31)
#define DMA_UR1T_STA      (*(unsigned char volatile __XDATA *)0xfa32)
#define DMA_UR1T_AMT      (*(unsigned char volatile __XDATA *)0xfa33)
#define DMA_UR1T_DONE     (*(unsigned char volatile __XDATA *)0xfa34)
#define DMA_UR1T_TXAH     (*(unsigned char volatile __XDATA *)0xfa35)
#define DMA_UR1T_TXAL     (*(unsigned char volatile __XDATA *)0xfa36)
#define DMA_UR1R_CFG      (*(unsigned char volatile __XDATA *)0xfa38)
#define DMA_UR1R_CR       (*(unsigned char volatile __XDATA *)0xfa39)
#define DMA_UR1R_STA      (*(unsigned char volatile __XDATA *)0xfa3a)
#define DMA_UR1R_AMT      (*(unsigned char volatile __XDATA *)0xfa3b)
#define DMA_UR1R_DONE     (*(unsigned char volatile __XDATA *)0xfa3c)
#define DMA_UR1R_RXAH     (*(unsigned char volatile __XDATA *)0xfa3d)
#define DMA_UR1R_RXAL     (*(unsigned char volatile __XDATA *)0xfa3e)

#define DMA_UR2T_CFG      (*(unsigned char volatile __XDATA *)0xfa40)
#define DMA_UR2T_CR       (*(unsigned char volatile __XDATA *)0xfa41)
#define DMA_UR2T_STA      (*(unsigned char volatile __XDATA *)0xfa42)
#define DMA_UR2T_AMT      (*(unsigned char volatile __XDATA *)0xfa43)
#define DMA_UR2T_DONE     (*(unsigned char volatile __XDATA *)0xfa44)
#define DMA_UR2T_TXAH     (*(unsigned char volatile __XDATA *)0xfa45)
#define DMA_UR2T_TXAL     (*(unsigned char volatile __XDATA *)0xfa46)
#define DMA_UR2R_CFG      (*(unsigned char volatile __XDATA *)0xfa48)
#define DMA_UR2R_CR       (*(unsigned char volatile __XDATA *)0xfa49)
#define DMA_UR2R_STA      (*(unsigned char volatile __XDATA *)0xfa4a)
#define DMA_UR2R_AMT      (*(unsigned char volatile __XDATA *)0xfa4b)
#define DMA_UR2R_DONE     (*(unsigned char volatile __XDATA *)0xfa4c)
#define DMA_UR2R_RXAH     (*(unsigned char volatile __XDATA *)0xfa4d)
#define DMA_UR2R_RXAL     (*(unsigned char volatile __XDATA *)0xfa4e)

#define DMA_UR3T_CFG      (*(unsigned char volatile __XDATA *)0xfa50)
#define DMA_UR3T_CR       (*(unsigned char volatile __XDATA *)0xfa51)
#define DMA_UR3T_STA      (*(unsigned char volatile __XDATA *)0xfa52)
#define DMA_UR3T_AMT      (*(unsigned char volatile __XDATA *)0xfa53)
#define DMA_UR3T_DONE     (*(unsigned char volatile __XDATA *)0xfa54)
#define DMA_UR3T_TXAH     (*(unsigned char volatile __XDATA *)0xfa55)
#define DMA_UR3T_TXAL     (*(unsigned char volatile __XDATA *)0xfa56)
#define DMA_UR3R_CFG      (*(unsigned char volatile __XDATA *)0xfa58)
#define DMA_UR3R_CR       (*(unsigned char volatile __XDATA *)0xfa59)
#define DMA_UR3R_STA      (*(unsigned char volatile __XDATA *)0xfa5a)
#define DMA_UR3R_AMT      (*(unsigned char volatile __XDATA *)0xfa5b)
#define DMA_UR3R_DONE     (*(unsigned char volatile __XDATA *)0xfa5c)
#define DMA_UR3R_RXAH     (*(unsigned char volatile __XDATA *)0xfa5d)
#define DMA_UR3R_RXAL     (*(unsigned char volatile __XDATA *)0xfa5e)

#define DMA_UR4T_CFG      (*(unsigned char volatile __XDATA *)0xfa60)
#define DMA_UR4T_CR       (*(unsigned char volatile __XDATA *)0xfa61)
#define DMA_UR4T_STA      (*(unsigned char volatile __XDATA *)0xfa62)
#define DMA_UR4T_AMT      (*(unsigned char volatile __XDATA *)0xfa63)
#define DMA_UR4T_DONE     (*(unsigned char volatile __XDATA *)0xfa64)
#define DMA_UR4T_TXAH     (*(unsigned char volatile __XDATA *)0xfa65)
#define DMA_UR4T_TXAL     (*(unsigned char volatile __XDATA *)0xfa66)
#define DMA_UR4R_CFG      (*(unsigned char volatile __XDATA *)0xfa68)
#define DMA_UR4R_CR       (*(unsigned char volatile __XDATA *)0xfa69)
#define DMA_UR4R_STA      (*(unsigned char volatile __XDATA *)0xfa6a)
#define DMA_UR4R_AMT      (*(unsigned char volatile __XDATA *)0xfa6b)
#define DMA_UR4R_DONE     (*(unsigned char volatile __XDATA *)0xfa6c)
#define DMA_UR4R_RXAH     (*(unsigned char volatile __XDATA *)0xfa6d)
#define DMA_UR4R_RXAL     (*(unsigned char volatile __XDATA *)0xfa6e)

#define DMA_LCM_CFG       (*(unsigned char volatile __XDATA *)0xfa70)
#define DMA_LCM_CR        (*(unsigned char volatile __XDATA *)0xfa71)
#define DMA_LCM_STA       (*(unsigned char volatile __XDATA *)0xfa72)
#define DMA_LCM_AMT       (*(unsigned char volatile __XDATA *)0xfa73)
#define DMA_LCM_DONE      (*(unsigned char volatile __XDATA *)0xfa74)
#define DMA_LCM_TXAH      (*(unsigned char volatile __XDATA *)0xfa75)
#define DMA_LCM_TXAL      (*(unsigned char volatile __XDATA *)0xfa76)
#define DMA_LCM_RXAH      (*(unsigned char volatile __XDATA *)0xfa77)
#define DMA_LCM_RXAL      (*(unsigned char volatile __XDATA *)0xfa78)

/////////////////////////////////////////////////

#endif
